import { html } from '../lib.js'

export function showInfo(ctx) {
    ctx.render(infoTemp())
}

const infoTemp = () => html`
    <section class="firstsection">
      <div class="box-main">
          <div class="firstHalf">
            <p class="description-text pink-flamingo-description">
            &emsp;&emsp;&emsp;Фламингото обикновено стои на един крак, а другият е прибран под тялото. Причината за това поведение не е напълно разбрана. Една теория е, че стоенето на един крак позволява на птиците да запазят повече телесна топлина, като се има предвид, че те прекарват значително време в газене в студена вода. Поведението обаче се проявява и в топла вода и се наблюдава и при птици, които обикновено не стоят във вода. Алтернативна теория е, че стоенето на един крак намалява разхода на енергия за генериране на мускулно усилие за стоене и балансиране на един крак. Проучване върху трупове показа, че позата с един крак може да се задържи без никаква мускулна активност, докато живите фламинго демонстрират значително по-малко люлеене на тялото в поза с един крак. Освен че стоят във водата, фламингото може да тропа с ципестите си крака в тинята, за да разбърка храна от дъното.     
            </p>
          </div>
      </div>

      <div class="wrapper">
        <div class="image-wrapper">
          <img class="info-flamingo-img" src="../imgs/flamingos-river.jpg" /></div>
        </div>
      </div>

      <div class="box-main">
          <div class="firstHalf">
            <p class="description-text ">
            &emsp;&emsp;&emsp;Младите фламингота се излюпват със сивкавочервено оперение, но възрастните варират от светлорозово до яркочервено поради водните бактерии и бета-каротина, получени от храната им. Добре охраненото здраво фламинго е с по-живи цветове, следователно е по-желан партньор; бяло или бледо фламинго обаче обикновено е нездравословно или недохранено. Фламинготата в плен са забележително изключение; те могат да станат бледорозови, ако не се хранят с каротин в нива като дивите.     
            </p>
          </div>
      </div>

  </section>
`