import { html } from "../lib.js";

export function showLakeView(ctx) {
    ctx.render(lakeViewTemp())
}

const lakeViewTemp = () => html`
    <section class="thirdsection">
        
        <div class="box-main">
            <div class="secondHalf">
                <p class="text-small">
                    &emsp;&emsp;&emsp;Най-вероятната причина е промяна в климата, другата е нарастване на популацията на фламингото в Европа. За съжаление е възможно и някои отрицателни промени да са настъпили във влажните зони, където то се размножава и птиците са се разселили. Но в такъв случай биха били единици, а не толкова много. Розовото фламинго се превръща в една постоянна атракция. Бройката им непрекъсното расте. Атанасовско езеро ги привлича с обилието на храна. Освен това обичат плитки лагуни. Един от видовете, с които те се хранят, е солничното раче. В езерото има много от този вид и вероятно това е причината да се задържат целогодишно.
                </p>
            </div>
        </div>
  
        <div class="wrapper">
          <div class="image-wrapper">
            <img class="info-flamingo-img" src="../imgs/flamingo-lake.jpg" /></div>
          </div>
        </div>
  
        <div class="box-main second-box-main">
            <div class="firstHalf">
                <p class="description-text ">
                    &emsp;&emsp;&emsp;През 80-те години на миналия век големият български природозащитник и орнитолог Николай Боев като се съставяше първата Червена книга на България предлагаше да се насърчава гнезденето на фламингото тук. Сега тази негова мечта става доста реална. Но няма да е лесно, защото това са големи птици, нуждаят се от голямо водна площ и спокойствие.
                </p>
            </div>
        </div>
  
      </section>
`